MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1025DAK169/mcu.h
#define _CNNEH_CNNEH2_POSITION                   0x00000002
#define _CNNEH_CNNEH2_MASK                       0x00000004
#define _CNNEH_CNNEH2_LENGTH                     0x00000001

#define _CNNEH_CNNEH3_POSITION                   0x00000003
#define _CNNEH_CNNEH3_MASK                       0x00000008
#define _CNNEH_CNNEH3_LENGTH                     0x00000001

#define _CNNEH_CNNEH4_POSITION                   0x00000004
#define _CNNEH_CNNEH4_MASK                       0x00000010
#define _CNNEH_CNNEH4_LENGTH                     0x00000001

#define _CNNEH_CNNEH5_POSITION                   0x00000005
#define _CNNEH_CNNEH5_MASK                       0x00000020
#define _CNNEH_CNNEH5_LENGTH                     0x00000001

#define _CNNEH_CNNEH6_POSITION                   0x00000006
#define _CNNEH_CNNEH6_MASK                       0x00000040
#define _CNNEH_CNNEH6_LENGTH                     0x00000001

#define _CNNEH_CNNEH7_POSITION                   0x00000007
#define _CNNEH_CNNEH7_MASK                       0x00000080
#define _CNNEH_CNNEH7_LENGTH                     0x00000001

#define _CNNEH_CNNEH8_POSITION                   0x00000008
#define _CNNEH_CNNEH8_MASK                       0x00000100
#define _CNNEH_CNNEH8_LENGTH                     0x00000001

#define _CNNEH_CNNEH9_POSITION                   0x00000009
#define _CNNEH_CNNEH9_MASK                       0x00000200
#define _CNNEH_CNNEH9_LENGTH                     0x00000001

#define _CNNEH_CNNEH10_POSITION                  0x0000000A
#define _CNNEH_CNNEH10_MASK                      0x00000400
#define _CNNEH_CNNEH10_LENGTH                    0x00000001

#define _CNNEH_CNNEH11_POSITION                  0x0000000B
#define _CNNEH_CNNEH11_MASK                      0x00000800
#define _CNNEH_CNNEH11_LENGTH                    0x00000001

#define _CNNEH_CNNEH12_POSITION                  0x0000000C
#define _CNNEH_CNNEH12_MASK                      0x00001000
#define _CNNEH_CNNEH12_LENGTH                    0x00000001

#define _CNNEH_CNNEH13_POSITION                  0x0000000D
#define _CNNEH_CNNEH13_MASK                      0x00002000
#define _CNNEH_CNNEH13_LENGTH                    0x00000001

#define _CNNEH_CNNEH14_POSITION                  0x0000000E
#define _CNNEH_CNNEH14_MASK                      0x00004000
#define _CNNEH_CNNEH14_LENGTH                    0x00000001

#define _CNNEH_CNNEH15_POSITION                  0x0000000F
#define _CNNEH_CNNEH15_MASK                      0x00008000
#define _CNNEH_CNNEH15_LENGTH                    0x00000001

#define _CNFH_CNFH0_POSITION                     0x00000000
#define _CNFH_CNFH0_MASK                         0x00000001
#define _CNFH_CNFH0_LENGTH                       0x00000001

#define _CNFH_CNFH1_POSITION                     0x00000001
#define _CNFH_CNFH1_MASK                         0x00000002
#define _CNFH_CNFH1_LENGTH                       0x00000001

#define _CNFH_CNFH2_POSITION                     0x00000002
#define _CNFH_CNFH2_MASK                         0x00000004
#define _CNFH_CNFH2_LENGTH                       0x00000001

#define _CNFH_CNFH3_POSITION                     0x00000003
#define _CNFH_CNFH3_MASK                         0x00000008
#define _CNFH_CNFH3_LENGTH                       0x00000001

#define _CNFH_CNFH4_POSITION                     0x00000004
#define _CNFH_CNFH4_MASK                         0x00000010
#define _CNFH_CNFH4_LENGTH                       0x00000001

#define _CNFH_CNFH5_POSITION                     0x00000005
#define _CNFH_CNFH5_MASK                         0x00000020
#define _CNFH_CNFH5_LENGTH                       0x00000001

#define _CNFH_CNFH6_POSITION                     0x00000006
#define _CNFH_CNFH6_MASK                         0x00000040
#define _CNFH_CNFH6_LENGTH                       0x00000001

#define _CNFH_CNFH7_POSITION                     0x00000007
#define _CNFH_CNFH7_MASK                         0x00000080
#define _CNFH_CNFH7_LENGTH                       0x00000001

#define _CNFH_CNFH8_POSITION                     0x00000008
#define _CNFH_CNFH8_MASK                         0x00000100
#define _CNFH_CNFH8_LENGTH                       0x00000001

#define _CNFH_CNFH9_POSITION                     0x00000009
#define _CNFH_CNFH9_MASK                         0x00000200
#define _CNFH_CNFH9_LENGTH                       0x00000001

#define _CNFH_CNFH10_POSITION                    0x0000000A
#define _CNFH_CNFH10_MASK                        0x00000400
#define _CNFH_CNFH10_LENGTH                      0x00000001

#define _CNFH_CNFH11_POSITION                    0x0000000B
#define _CNFH_CNFH11_MASK                        0x00000800
#define _CNFH_CNFH11_LENGTH                      0x00000001

#define _CNFH_CNFH12_POSITION                    0x0000000C
#define _CNFH_CNFH12_MASK                        0x00001000
#define _CNFH_CNFH12_LENGTH                      0x00000001

#define _CNFH_CNFH13_POSITION                    0x0000000D
#define _CNFH_CNFH13_MASK                        0x00002000
#define _CNFH_CNFH13_LENGTH                      0x00000001

#define _CNFH_CNFH14_POSITION                    0x0000000E
#define _CNFH_CNFH14_MASK                        0x00004000
#define _CNFH_CNFH14_LENGTH                      0x00000001

#define _CNFH_CNFH15_POSITION                    0x0000000F
#define _CNFH_CNFH15_MASK                        0x00008000
#define _CNFH_CNFH15_LENGTH                      0x00000001

#define _SRCON0H_SR0H0_POSITION                  0x00000000
#define _SRCON0H_SR0H0_MASK                      0x00000001
#define _SRCON0H_SR0H0_LENGTH                    0x00000001

#define _SRCON0H_SR0H1_POSITION                  0x00000001
#define _SRCON0H_SR0H1_MASK                      0x00000002
#define _SRCON0H_SR0H1_LENGTH                    0x00000001

#define _SRCON0H_SR0H2_POSITION                  0x00000002
#define _SRCON0H_SR0H2_MASK                      0x00000004
#define _SRCON0H_SR0H2_LENGTH                    0x00000001

#define _SRCON0H_SR0H3_POSITION                  0x00000003
#define _SRCON0H_SR0H3_MASK                      0x00000008
#define _SRCON0H_SR0H3_LENGTH                    0x00000001

#define _SRCON0H_SR0H4_POSITION                  0x00000004
#define _SRCON0H_SR0H4_MASK                      0x00000010
#define _SRCON0H_SR0H4_LENGTH                    0x00000001

#define _SRCON0H_SR0H5_POSITION                  0x00000005
#define _SRCON0H_SR0H5_MASK                      0x00000020
#define _SRCON0H_SR0H5_LENGTH                    0x00000001

